# 1장 서울시 구별 CCTV 현황 분석

## 1 - 1 CCTV 현황과 인구 현황 데이터 구하기

서울시의 CCTV 현황은 구글 검색만으로도 쉽게 얻을 수 있다.
CSV 파일은 콤마로 구분된 텍스트 파일입니다. 우리나라에서는 잘통용되지 않지만 외국 자료를 검색하다 보면 자주 나타납니다. 텍스트 파일이기 때문에 메모장에서도 열립니다. 그런데 만약 CSV 파일에 한글이 UTF-8로 인코딩 되어있다면 엑셀에서 열었을 때 한글이 깨져 보일 수 있습니다. 그것은 MS 오피스 제품들이 UFT-8을 지원하지 않기 때문이며 파일에 문제가 있는 것은 아닙니다. <br>
(저는 ubuntu를 사용하고 있기때문에 github를 클론 따와서 사용하였습니다.) <br>
https://github.com/PinkWink/DataScience

## 1 - 2 파이썬에서 텍스트 파일과 엑셀 파일 읽기

파이썬에서는 이런 종류의 파일을 쉽게 읽을 수 있는 모듈이 있습니다. 바로 pandas라는 모듈입니다. <br>

In [2]:
import pandas as pd

파이썬에서 원하는 모듈을 불러오는 명령이 import입니다. 그뒤에 원하는 모듈명을 넣게 됩니다. 모듈명이 다음의 as는 as뒤에 붙는 pd라는 짧은 단어로 pandas를 대체하겠다는 뜻입니다. 즉, pandas의 read_csv라는 의미로 pandas.read_csv라고 하지 않고 pd.read_csv라고 쓰겠다는 의미 입니다. <br>
pandas에서 CSV 파일을 읽는 명령은 read_csv입니다. 그안에 한글을 사용하는 경우는 인코딩에 신경 써야 합니다. 우리가 받은 CCTV 데이터는 UTF-8로 인코딩되어 있어서 read_csv 명령을 쓸 때 incoding 옵션에 UTF-8이라고 저장해야 합니다. 이때 사용된 head() 명령은 pandas 데이터의 첫 5행만 보여달라는 것입니다.

In [3]:
CCTV_Seoul = pd.read_csv('./data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

pandas 데이터는 제일 첫 줄에 보이는 것이 해당하는 열(column)을 대표하는ㄴ 일종의 제목입니다. <br>
그래서 첫 줄은 특별히 column이라고 합니다. 데이터 뒤에 columns라고 하면 column의 이름들이 반환됩니다.

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

그런데 기관명이라고 되어 있으니 이를 '구별'이라는 이름으로 하겠습니다. 이렇게 이름을 바꾸는 명령은 rename이라고 합니다. 그리고 그 명령 안에 사용된 inplace=True는 실제 CCTV_Seoul이라는 변수의 내용을 갱신하라는 의미 입니다.

In [6]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

이제 엑셀 파일을 읽어야 합니다. 그명령은 read_excel입니다. 그냥 인코딩만 지정하고 읽었더니 약간 이상합니다. 그것은 원본 엑셀 파일이 첫 세줄이 열의 제목처럼 되어 있기 때문입니다.

In [7]:
pop_Seoul = pd.read_excel('./data/01. population_in_Seoul.xls',  encoding='utf-8')
pop_Seoul.head()

TypeError: read_excel() got an unexpected keyword argument 'encoding'

일단 엑셀을 읽는 rad_excel 명령 안에서 세 번째 줄부터 읽으라는 header=2라는 옵션을 걸고, B, D, G, J, N 열만 읽도록 parse_cols='B,D,G,J,N'이라는 옵션을 넣었습니다.

In [20]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls', 
                          header = 2,
                          usecols = 'B, D, G, J, N',
                          encoding='utf-8')
pop_Seoul.head()

TypeError: read_excel() got an unexpected keyword argument 'encoding'

출력된 모습도 간결하게 되었습니다. 그러나 컬럼의 이름에 문제가 있는 듯합니다. rename 명령을 사용해서 컬럼의 이름을 변경합니다.

In [8]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별', 
                          pop_Seoul.columns[1] : '인구수', 
                          pop_Seoul.columns[2] : '한국인', 
                          pop_Seoul.columns[3] : '외국인', 
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

NameError: name 'pop_Seoul' is not defined

CCTV_Seoul이라는 변수에는 '구별 CCTV 현황'을, pop_Seoul이라는 변수에는 '구별 인구 현황'을 저장했습니다. pandas에서 몇 줄 입력하지 않았는데 우리는 두종류의 파일을 보기 좋게 읽게 되었습니다.

# 1 - 3 pandas 기초 익히기

pandas의 사용 빈도가 높아서 기초를 익히고 지나가자 그리고 본 절의 튜토리얼은 pandas의 튜토리얼이 다수 포함되어 있습니다.

In [82]:
import pandas as pd
import numpy as np

In [83]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

pandas의 데이터 유형 중 기초가 되는 것이 Series입니다. 대괄호로 만드는 파이썬의 list 데이터로 만들 수 있습니다. 중간에 NaN(Not A Number)도 넣었습니다.

In [84]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

또 pandas에는 날짜형의 데이터인 date_range가 있습니다. 기본 날짜를 지정하고 periods 옵션으로 6일간이라고 지정합니다.

In [85]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, 
                  columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039
2013-01-04  1.130500 -1.484842 -0.750145  0.115784
2013-01-05 -1.142343  1.153934  0.774978 -0.178889
2013-01-06 -0.730527 -0.003311 -0.179792  0.417600

이제 DataFrame 유형의 데이터를 만듭니다. 6행 4열의 random 변수를 만들고, 컬럼에는 columns=['A','B','C','D']로 지정하고, index 명령으로 만든 날짜형 데이터인 dates를 index=dates 옵션을 이용해서 저장했습니다.

In [86]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039

head() 명령을 사용하면 기본적으로 첫 5행을 보여줍니다. 괄호 안에 숫자를 널어두면 그 숫자만큼의 행을 볼 수 있습니다.

In [87]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [88]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

그리고 index,columns 명령을 이용하면 pandas의 DataFrame의 컬럼과 인덱스를 확안할 수 있습니다.

In [89]:
df.values

array([[-8.21351154e-01, -1.75666123e+00, -3.25030693e-01,
         1.30454599e+00],
       [ 2.39944624e-01,  8.33322250e-01,  1.68603833e-01,
        -1.17790320e-03],
       [-1.59934867e-01,  1.94528498e-01, -1.48922415e+00,
        -2.32203919e+00],
       [ 1.13050013e+00, -1.48484175e+00, -7.50144506e-01,
         1.15783762e-01],
       [-1.14234329e+00,  1.15393440e+00,  7.74978212e-01,
        -1.78889414e-01],
       [-7.30526838e-01, -3.31134470e-03, -1.79792274e-01,
         4.17600202e-01]])

그리고 그 안에 들어가는 내용은 values 명령으로 확인할 수 있습니다. 또, info() 명령을 사용하면 DataFrame의 개요를 알 수 있습니다.

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

describe 명령어는 통계적 개요를 확인 할 수 있습니다. 개수와 평균 뿐만 안니라 min,max와 각 1/4 지점,표준편차까지 한번에 알 수 있습니다.

In [91]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.247285 -0.177172 -0.300102 -0.110696
std    0.837558  1.197173  0.775516  1.203327
min   -1.142343 -1.756661 -1.489224 -2.322039
25%   -0.798645 -1.114459 -0.643866 -0.134462
50%   -0.445231  0.095609 -0.252411  0.057303
75%    0.139975  0.673624  0.081505  0.342146
max    1.130500  1.153934  0.774978  1.304546

이때 values가 숫자가 아니라 문자라고 하더라도 그에 맞는 개요가 나타납니다.

In [92]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-05 -1.142343  1.153934  0.774978 -0.178889
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039
2013-01-06 -0.730527 -0.003311 -0.179792  0.417600
2013-01-04  1.130500 -1.484842 -0.750145  0.115784
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546

sort_values 명령은 by로 지정된 칼럼을 기준으로 정렬합니다. ascending 옵션을 사용하면 내림차순이나 오름차순으로 정렬시킬 수 있습니다.

In [93]:
df

                   A         B         C         D
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039
2013-01-04  1.130500 -1.484842 -0.750145  0.115784
2013-01-05 -1.142343  1.153934  0.774978 -0.178889
2013-01-06 -0.730527 -0.003311 -0.179792  0.417600

그냥 변수명을 적고 실행하면 그 내용이 나타납니다.

In [94]:
df['A']

2013-01-01   -0.821351
2013-01-02    0.239945
2013-01-03   -0.159935
2013-01-04    1.130500
2013-01-05   -1.142343
2013-01-06   -0.730527
Freq: D, Name: A, dtype: float64

DataFrame으로 선언된 변수의 경우 변수명 뒤에['A']와 같이 붙여주면 헤당 컬럼만 Series로 보여줍니다. 물론 head()라는 명령이 있지만 중간부터 보고 싶다면 행의 범위만 지정해서 df[0:3]이라고 하면 됩니다.

In [95]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039

만약 2013.01.02부터 2013.01.04까지의 행을 보고 싶다면

In [96]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039
2013-01-04  1.130500 -1.484842 -0.750145  0.115784

dates 변수를 이용해서 특정 날짜의 데이터만 보고 싶으면 df.loc 명령을 사용하면 됩니다.

In [97]:
df.loc[dates[0]]

A   -0.821351
B   -1.756661
C   -0.325031
D    1.304546
Name: 2013-01-01 00:00:00, dtype: float64

A,B열의 모든 행을 보고 싶다면

In [98]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.821351 -1.756661
2013-01-02  0.239945  0.833322
2013-01-03 -0.159935  0.194528
2013-01-04  1.130500 -1.484842
2013-01-05 -1.142343  1.153934
2013-01-06 -0.730527 -0.003311

행과 열의 범위를 모두 지정할 수도 있습니다.

In [99]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.239945  0.833322
2013-01-03 -0.159935  0.194528
2013-01-04  1.130500 -1.484842

2013년 1월 2일부터 2013년 1월 4일까지의 데이터중 A와 B 컬럼의 데이터만 선택하는것입니다.

In [100]:
df.loc['20130102',['A','B']]

A    0.239945
B    0.833322
Name: 2013-01-02 00:00:00, dtype: float64

또, 2013년 1월 2일의 A,B 컬럼의 내용을 확인하는 것입니다.

In [101]:
df.loc[dates[0],'A']

-0.8213511540914136

dates[0]에 맞는 날짜인 2013년 1월 1일에 A컴럼의 데이터만 확인할 수 있습니다. <tr>
그러나 loc 명령과 달리 행과 열의 번호를 이용해서 데이터에 바로 접근하고 싶을 수 있는데, 그 명령이 iloc입니다. iloc를 사용하면 행이나 열의 범위를 지정하면 됩니다. 특히 콜론(:)을 사용하면 전체를 의미합니다.

In [102]:
df.iloc[3]

A    1.130500
B   -1.484842
C   -0.750145
D    0.115784
Name: 2013-01-04 00:00:00, dtype: float64

먼저 iloc에 단지 숫자만 표시하면 3번 행을 의미합니다. (0번부터 시작하니깐 4번 행이 됩니다.)

In [103]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.130500 -1.484842
2013-01-05 -1.142343  1.153934

또 3번째부터 5번째 앞, 즉 3번째부터 4번째까지 행과 0번부터 1번까지 열의 데이터만 가져올 수 있습니다.

In [104]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.239945  0.168604
2013-01-03 -0.159935 -1.489224
2013-01-05 -1.142343  0.774978

또 범위가 아니라 콤마로 행이나 열을 지정해서 테이터를 가져올 수 있습니다. 행이나 열에 대해 한쪽은 전체를 의미하게 하고 싶을 때는 그냥 콜론만 사용하면 됩니다.

In [105]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039

이렇게 행은 범위를 주고, 열은 콜론으로 전체를 의미하게 하는 것입니다.

In [106]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.756661 -0.325031
2013-01-02  0.833322  0.168604
2013-01-03  0.194528 -1.489224
2013-01-04 -1.484842 -0.750145
2013-01-05  1.153934  0.774978
2013-01-06 -0.003311 -0.179792

반대로 행을 전체로 선택했습니다. 다시 df를 호출하겠습니다.

In [107]:
df

                   A         B         C         D
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039
2013-01-04  1.130500 -1.484842 -0.750145  0.115784
2013-01-05 -1.142343  1.153934  0.774978 -0.178889
2013-01-06 -0.730527 -0.003311 -0.179792  0.417600

DataFrame에서 특정 조건을 만족하는 데이터만 얻을 수 있습니다. 컬럼을 지정할 때 df['A']처럼 할 수도 있고, df.A와 같이 할 수도 있습니다. 컬럼 A에서 0보다 큰 행만 얻는 것입니다.

In [108]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-04  1.130500 -1.484842 -0.750145  0.115784

데이터 전체에서 조건을 걸면 만족하지 않은 곳은 NaN 처리가 됩니다.

In [109]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  1.304546
2013-01-02  0.239945  0.833322  0.168604       NaN
2013-01-03       NaN  0.194528       NaN       NaN
2013-01-04  1.130500       NaN       NaN  0.115784
2013-01-05       NaN  1.153934  0.774978       NaN
2013-01-06       NaN       NaN       NaN  0.417600

DataFrame을 복사할 때는 그냥 = 기호를 이용해서 복사해면 실제 데이터의 내용이 복사되는 것이 아니라 데이터 위치만 복사되기 때문에 원본 데이터는 하나만 있게 됩니다.

In [110]:
df2 = df.copy()

데이터의 내용까지 복사하라는 지령은 copy() 옵션을 붙여 넣으면 됩니다.

In [111]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546    one
2013-01-02  0.239945  0.833322  0.168604 -0.001178    one
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039    two
2013-01-04  1.130500 -1.484842 -0.750145  0.115784  three
2013-01-05 -1.142343  1.153934  0.774978 -0.178889   four
2013-01-06 -0.730527 -0.003311 -0.179792  0.417600  three

In [112]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

이렇게 만든 E 컬럼에서 two와 four가 있는지 조건을 걸고 싶을 때는 isin 명령을 쓰면 좋습니다.

In [113]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039   two
2013-01-05 -1.142343  1.153934  0.774978 -0.178889  four

그 결과는 True/False로 반환되는데, 이것을 이용하면 조건에 맞는 데이터를 선택할 수 있습니다.

In [114]:
df

                   A         B         C         D
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546
2013-01-02  0.239945  0.833322  0.168604 -0.001178
2013-01-03 -0.159935  0.194528 -1.489224 -2.322039
2013-01-04  1.130500 -1.484842 -0.750145  0.115784
2013-01-05 -1.142343  1.153934  0.774978 -0.178889
2013-01-06 -0.730527 -0.003311 -0.179792  0.417600

df변수에서 좀 더 통계 느낌의 데이터를 볼 때는 특정 함수를 적용시키면 좋습니다. 이때 사용하는 것이 apply 명렁입니다. 누적합을 알고 싶을 때는 numpy의 cumsum을 이용하면 됩니다.

In [115]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.821351 -1.756661 -0.325031  1.304546
2013-01-02 -0.581407 -0.923339 -0.156427  1.303368
2013-01-03 -0.741341 -0.728810 -1.645651 -1.018671
2013-01-04  0.389159 -2.213652 -2.395796 -0.902887
2013-01-05 -0.753185 -1.059718 -1.620817 -1.081777
2013-01-06 -1.483711 -1.063029 -1.800610 -0.664177

특별히 최대값과 최소값의 차이를 알고 싶다면 one-line 함수인 lambda를 이용할 수도 있습니다.

In [116]:
df.apply(lambda x: x.max() - x.min())

A    2.272843
B    2.910596
C    2.264202
D    3.626585
dtype: float64

# 1 - 4 pandas 이용해서 CCTV와 인구 현황 데이터 파악하기

In [117]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
0  강남구  2780       1292    430    584    932  150.619195
1  강동구   773        379     99    155    377  166.490765
2  강북구   748        369    120    138    204  125.203252
3  강서구   884        388    258    184     81  134.793814
4  관악구  1496        846    260    390    613  149.290780

구별 CCTV 데이터에서 CCTV 전체 개수인 소계로 정렬하겠습니다.

In [118]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년       최근증가율
9   도봉구  485        238    159     42    386  246.638655
12  마포구  574        314    118    169    379  212.101911
17  송파구  618        529     21     68    463  104.347826
24  중랑구  660        509    121    177    109   79.960707
23   중구  671        413    190     72    348  147.699758

CCTV의 전체 개수가 가장 작은 구는 '도봉구','마포구','송파구','중랑구','중구'라는 것을 알 수 있습니다. 의아스러운 것은 강남 3구 중 하나인 송파구가 CCTV가 가장 적은 구 중 하나라는 것인데, 2장에서 보면 송파구는 범죄율이 결코 낮은 구가 아닙니다. 그런데 CCTV가 적은 구 중에 하나입니다.

In [119]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
0   강남구  2780       1292    430    584    932  150.619195
18  양천구  2034       1843    142     30    467   34.671731
14  서초구  1930       1406    157    336    398   63.371266
21  은평구  1873       1138    224    278    468   85.237258
20  용산구  1624       1368    218    112    398   53.216374

그리고 CCTV가 가장 구는 표에있는 5개 구로 나타납니다. 특히 2014년분ㅌ터 2016년까지 최근 3년간 CCTV 수를 더하고 2013년 이전 CCTV수로 나눠서 최근 3년간 CCTV 증가율을 계산하겠습니다.

In [123]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년'] + CCTV_Seoul['2015년'] + \
                            CCTV_Seoul['2014년']) / CCTV_Seoul['2013년도 이전']  * 100
CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

그 결과를 보면 최근 3년간 CCTV가 그 이전 대비 많이 증가한 구는 '종로구','도봉구','마포구','노원구','강동구'라는 것도 알 수 있습니다. 이제 서울시 인구 현황을 정리해보겠습니다,

In [124]:
pop_Seoul.head()

NameError: name 'pop_Seoul' is not defined